Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །དེ་ལྟ་ན་ནི་ཆོས་ལས་ཆོས་ཉིད་ཐ་དད་པར་འགྱུར་རོ་སྙམ་པ་ལ། སྟོང་པ་ཉིད་ལས་གུད་ན་ཡང་གཟུགས་མི་རྟག་པ་མ་མཆིས་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: To those who think, “In that case the true nature of a dharma is different from the dharma,” it says “and form that is impermanent is not other than emptiness.”

source: དེ་བཞིན་ཉིད་ལས་གུད་ན་ཀུན་བརྟགས་པའི་གཟུགས་མི་རྟག་པ་ཉིད་ཡོད་པ་མ་ཡིན་ཏེ། ཆུ་དངས་པ་དང་། ནམ་མཁའ་བཞིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means that there is no impermanence of a falsely imagined form other than suchness, like clean water and space.

source: །གང་གི་ཕྱིར་ཐ་དད་པར་གྱུར་པ་མེད་པ་དེའི་ཕྱིར་སྟོང་པ་ཉིད་ཀྱང་གཟུགས་མི་རྟག་པ་ཉིད་དོ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Because they are not different, it says “and emptiness itself is form that is impermanent.”

source: གཟུགས་མི་རྟག་པའི་སྟོང་པ་ཉིད་ལ་སྟོང་པ་ཉིད་ཀྱི་སྒྲར་བརྗོད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: The idea is that emptiness is a word to convey the emptiness of form that is impermanent.

source: །དེ་བཞིན་དུ་ཐམས་ཅད་ལ་ཡང་སྦྱར་བར་བྱའོ། །དེ་ལྟར་མི་གནས་པར་སྒྲུབ་པ་བསྟན་ནས།
en: Connect this in the same way with all the rest.

source: གནས་པའི་ཉེས་དམིགས་བསྟན་པའི་ཕྱིར། བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གལ་ཏེ་ཐབས་མི་མཁས་པས་བདག་ཏུ་འཛིན་པ་དང་། བདག་གིར་འཛིན་པར་ལྷུང་བའི་ཡིད་ཀྱིས་གཟུགས་ལ་གནས་ན་དེ་གཟུགས་མངོན་པར་འདུ་བགྱི་བ་ལ་སྤྱོད་ཀྱི། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མི་སྤྱོད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ།
en: Practice that does not fully grasp Having thus taught practice that does not stand, to teach the faults of standing, it says, “Furthermore, Lord, when bodhisattva great beings practicing the perfection of wisdom without skill in means stand in form with a mind that has descended into grasping at ‘I’ and grasping at ‘mine,’ they practice an enactment of form, and they do not practice the perfection of wisdom,” and so on.

source: གལ་ཏེ་ཐབས་མི་མཁས་པས། ཚུལ་བཞིན་མ་ཡིན་པར་བཟུང་ནས་ཆོས་རྣམས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་དུ་མི་ཤེས་པས་བདག་ནི་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་ཡིན་ནོ་ཞེས་བྱ་བའམ། གཟུགས་འདི་ནི་བདག་ཡིན་ནོ་ཞེས་བྱ་བའམ། འདི་ནི་གཟུགས་སུ་རུང་བའི་མཚན་ཉིད་དོ་ཞེས་བྱ་བར་གཟུགས་ལ་གནས་ན་དེ་གཟུགས་མངོན་པར་འདུ་བྱེད་པ་སྟེ་གཟུགས་སུ་རྣམ་པར་རྟོག་པའི་རྗེས་སུ་སོང་བ་འདུ་བྱེད་ཀྱི་ཆོས་ལ་སྤྱོད་པ་ཡིན་གྱི། སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་ཀྱི་རྗེས་སུ་འབྲང་བ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means if, “without skill in means”—which is to say if, having incorrectly grasped dharmas without knowing that they are characterized as something that does not exist—they “stand in form,” and think, “I am, in my basic nature, form,” or “this form is me,” or “it is defined as being seeable,” then they “practice an enactment of form,” that is, a karmically formed phenomenon that ensues when there is the conception of form, “not the perfection of wisdom” that follows emptiness.

source: །མངོན་པར་འདུ་བྱེད་པ་ལ་སྤྱོད་པའི་ཉེས་དམིགས་བསྟན་པའི་ཕྱིར། མངོན་པར་འདུ་བགྱི་བ་ལ་སྤྱོད་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསྒོམ་པ་མ་ལགས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: To teach the faults of practicing an enactment, it says “practicing an enactment [they] do not cultivate the perfection of wisdom,” and so on.

source: །ཅིའི་ཕྱིར་དེ་ལྟར་ཐབས་མི་མཁས་པས་བདག་ཏུ་འཛིན་པ་དང་། བདག་གིར་འཛིན་པར་ལྷུང་བས་མངོན་པར་འདུ་བྱེད་པ་ལ་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། ཡོངས་སུ་འཛིན་པ་མེད་པའི་རྣལ་འབྱོར་ལ་འཇུག་པ་དང་། ཡོངས་སུ་རྫོགས་པས་ངེས་པར་འབྱུང་བ་རྣམས་ཐོབ་པར་མི་འགྱུར་ཞེས་བྱ་སྙམ་པ་ལ།
en: To those thinking, “Why, without such skill in means, when practicing an enactment of form and descending into grasping at ‘I’ and grasping at ‘mine,’ do they not attain the practice of the perfection of wisdom, and not attain the definite emergences by becoming absorbed in and completing the yogic practice that does not fully grasp?”

source: བཅོམ་ལྡན་འདས་འདི་ལྟར་གཟུགས་ནི་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ།
en: it says, “It is because, Lord, form is not fully grasped,” and so on.

source: འདི་ནི་ཡོངས་སུ་འཛིན་པ་མེད་པར་སྒྲུབ་པ་ཞེས་བྱའོ།
en: This is the “practice that does not fully grasp.”

source: །སྒྲུབ་པ་འདི་ཡང་རྣམ་པ་གསུམ་གྱིས་བསྟན་ཏེ། ཆོས་ཡོངས་སུ་མི་འཛིན་པ་དང་། མཚན་མ་ཡོངས་སུ་མི་འཛིན་པ་དང་། ཤེས་པ་ཡོངས་སུ་མི་འཛིན་པའོ།
en: It teaches this practice in three parts as well: not fully grasping dharmas, not fully grasping causal signs, and not fully grasping understanding.

source: །དེ་ལས་ཆོས་ཡོངས་སུ་མི་འཛིན་པའི་འགྲེས་ནི། གཟུགས་ནི་ཡོངས་སུ་བཟུང་བ་མ་མཆིས་པ་དང་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ཡང་ནང་སྟོང་པ་ཉིད་ནས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པ་ཞེས་བྱ་བའི་བར་དུའོ།
en: Among these, the subsection explaining not fully grasping dharmas is from “form is not fully grasped, and…,” and from “that knowledge of all aspects is not fully grasped, because of inner emptiness,” up to “because of the emptiness that is the nonexistence of an intrinsic nature.”

source: །མཚན་མ་ཡོངས་སུ་མི་འཛིན་པའི་འགྲེས་ནི་དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: The subsection on not fully grasping causal signs starts from, “And why?

source: དེ་ནི་མཚན་མར་བརྗོད་པ་མ་ལགས་ཏེ་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། དེ་དེ་ལྟར་ཞུགས་ནས་གཟུགས་ཡོངས་སུ་མ་བཟུང་། ཚོར་བ་ཡོངས་སུ་མ་བཟུང་བ་ནས། ཡང་དག་པའི་མཐའ་ཡོངས་སུ་མ་བཟུང་ཞེས་བྱ་བའི་བར་དུའོ།
en: Because it cannot be expressed as a causal sign,” and goes up to “having thus comprehended he did not fully grasp form, did not fully grasp feeling,” and up to “did not fully grasp the very limit of reality.”

source: །ཤེས་པ་ཡོངས་སུ་མི་འཛིན་པའི་འགྲེས་ནི། དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: The subsection of the passage on not fully grasping understanding is from, “And why?

source: འདི་ལྟར་དེས་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཆོས་ཐམས་ཅད་ལ་ཡོངས་སུ་འཛིན་པ་མི་དམིགས་ཏེ་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པའི་སླད་དུ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: Because he did not apprehend a grasper of all dharmas that are empty of their own mark,” up to, “Lord, because all dharmas are not fully grasped, it is the bodhisattva great being’s perfection of wisdom.”

source: །དེ་ལ་དང་པོ་ཆོས་ཡོངས་སུ་མི་འཛིན་པའི་འགྲེས་ལས། གཟུགས་ནི་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པ་ཞེས་བྱ་བ་ནི། བདག་གི་ཕྱིར་ཆོས་ཉིད་ཀྱི་གཟུགས་ལ་ནི་བདག་ཏུ་འཛིན་པ་དང་། བདག་གིར་འཛིན་པར་ལྷུང་བའི་རྒྱུ་གང་གིས་ཀྱང་། གཟུགས་སུ་གཟུང་བ་མེད་དེ།
en: Not Fully Grasping Dharmas There, first, in the subsection explaining not fully grasping dharmas, in regard to “form is not fully grasped,” because of the self, the true dharmic nature of form—whatever the cause of a descent into grasping at “I” and grasping at “mine”—is not grasped as form.

source: དེའི་ཕྱིར་མངོན་པར་འདུ་བྱེད་པ་ལ་སྤྱོད་ན་དོན་དམ་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱད་པ་ལ་སྤྱོད་པ་མ་ཡིན་ནོ་ཞེས་སྟོན་ཏོ།
en: Therefore, it teaches that when an enactment is practiced, it is not a practice practicing the ultimate perfection of wisdom. “

source: །ཅིའི་ཕྱིར་གཟུགས་ཡོངས་སུ་གཟུང་བ་མེད་ཅེས་བྱ་ཞེ་ན།
en: And why” is form not fully grasped?

source: འདི་ལྟར་གཟུགས་ཀྱི་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པ་གང་ལགས་པ་དེ་ཡང་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ་གཟུགས་མ་ལགས་ཞེས་བྱ་བ་གསུངས་སོ།
en: It says, “Because a form not fully grasped is not form, because of the emptiness of a basic nature.”

source: །འདི་ལ་ཡོངས་སུ་གཟུང་བ་མེད་ཅེས་བྱ་བ་ནི་ཡོངས་སུ་བསྒྲུབ་པའི་མཚན་ཉིད་ལ་བྱ་སྟེ།
en: Here, take “not fully grasped” with the mark of a thoroughly established phenomenon.

source: དེ་སྐད་བརྗོད་དེ་ཆོས་ཉིད་ཀྱི་གཟུགས་ཀྱིས་ཡོངས་སུ་གཟུང་བ་མེད་པ་ཡོངས་སུ་གྲུབ་པའི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་ནི་ཀུན་བརྟགས་པའི་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་མ་ཡིན་ཏེ་དེའི་ཕྱིར།
en: It is saying that the true dharmic nature of form that is not fully grasped, which is the intrinsic nature of a thoroughly established phenomenon, is not a falsely imagined form’s intrinsic nature. Therefore, the true dharmic nature of form is connected with “is not fully grasped.” “

source: ཆོས་ཉིད་ཀྱི་ཆོས་ནི་ཡོངས་སུ་གཟུང་བ་མེད་དོ་ཞེས་བྱ་བར་སྦྱར་རོ། །རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ་ཞེས་བྱ་བ་ནི་གཟུགས་ལ་སོགས་པའི་ཆོས་ཀྱི་རྣམ་པ་གང་ཡང་སྔར་ཡོངས་སུ་བཟུང་ནས་ཕྱིས་གཉེན་པོ་གཞན་གང་གིས་ཀྱང་སྟོང་པར་བྱ་བ་ནི་མེད་ཀྱི།
en: Because of the emptiness of a basic nature” means it is not the case that, having fully grasped some aspect of an attribute of form and so on earlier, later some other counteracting force will make it empty.

source: དེའི་རང་བཞིན་ནི་སྟོང་པ་ཉིད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Its basic nature is emptiness.

source: །དེ་བཞིན་དུ་ཚོར་བ་ལ་སོགས་པ་དང་ཡང་དག་པའི་མཐའི་བར་དག་ལ་ཡང་སྦྱར་བར་བྱའོ།
en: Construe from “feeling” and so on, up to “the very limit of reality,” like that as well. “

source: །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་གྱི་དཀྱིལ་འཁོར་ཆོས་ཐམས་ཅད་ཡོངས་སུ་མ་བཟུང་བ་ཞེས་བགྱི་བ་སྟེ། རྒྱ་ཆེ་བ་ཕུལ་དུ་བགྱི་བ། ཚད་མ་མཆིས་པ། ངེས་པ། མི་འཕྲོགས་པ།
en: Lord, this meditative concentration sphere of bodhisattva great beings is called sarva­dharmāparigṛhīta; it is vast, prized, infinite, fixed, cannot be stolen, and is not shared in common with śrāvakas and pratyekabuddhas” teaches its dharma. “

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཐུན་མོང་མ་ལགས་པ་ཞེས་བྱ་བ་ནི་དེའི་ཆོས་བསྟན་པའོ། །ཏིང་ངེ་འཛིན་གྱི་དཀྱིལ་འཁོར་དེ་ལ་གནས་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་ཕན་ཡོན་བསྟན་པའོ།
en: Abiding in that sphere of meditative stabilizations” and so on teaches the benefit. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ཡང་། ནང་སྟོང་པ་ཉིད་ནས། དངོས་པོ་མེད་པ་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ་ཡོངས་སུ་གཟུང་བ་མ་མཆིས་པའོ་ཞེས་བྱ་བ་ནི་གང་གི་ཕྱིར་སྟོང་པ་ཉིད་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་ཡོངས་སུ་སྦྱངས་པ་ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པའི་མཐར་ཕྱིན་པ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱ་བར་འགྱུར་ཏེ། དེ་བས་ན་དེ་ཡང་ཡོངས་སུ་མ་བཟུང་བ་ཞེས་བསྟན་ཏོ།
en: And that knowledge of all aspects is not fully grasped, because of inner emptiness,” up to “emptiness that is the nonexistence of an intrinsic nature,” is teaching that because the completion of the thoroughly cleansed transcendental knowledge of all the emptinesses when all dharmas are not apprehended is “the knowledge of all aspects,” therefore it too is “not fully grasped.”

source: །དེའི་ཕྱིར་དེ་ནི་མཚན་མར་བརྗོད་པ་མ་ལགས་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Therefore, it says “it cannot be expressed as a causal sign.”

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མཚན་མ་དང་བྲལ་བ་སྟེ།
en: This means that even the knowledge of all aspects is separated from the causal sign of the knowledge of all aspects because it definitely does not have a mental image of a causal sign. “

source: མཚན་མའི་རྣམ་པ་ཡོང་ཡེ་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །འདི་ལྟར་མཚན་མ་ནི་ཉོན་མོངས་པ་མ་ལགས་པའི་སླད་དུ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྣམ་པར་རྟོག་པའི་མཚན་མ་ཉིད་སེམས་ཀྱི་རྒྱུད་ཉོན་མོངས་པར་འགྱུར་བས་ན་ཉོན་མོངས་པ་ཞེས་བྱ་བར་བསྟན་ཏོ།
en: Because a causal sign is an affliction”— the very causal signs of the bodhisattvas’ conceptualizations afflict the mindstream, so they are taught to be “affliction.”

source: །དེ་དག་གིས་ཀྱང་མཚན་མ་ཡོངས་སུ་མི་འཛིན་པའི་འགྲེས་བསྟན་ཏེ། མཚན་མ་གང་ཞེ་ན།
en: Not Fully Grasping Causal Signs The subsection on not fully grasping causal signs also explains in terms of these, so it says, “What is a causal sign?

source: གཟུགས་ནི་མཚན་མའོ་ཞེས་བྱ་བ་ལ་སོགས་པའོ།
en: Form is a causal sign,” and so on.

source: །དེ་དག་ཐམས་ཅད་ཀྱང་དོན་དམ་པར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཉོན་མོངས་པ་ཡིན་པས་སྤང་བར་བྱ་བ་ཡིན་ཏེ། འདོད་ཆགས་ལ་སོགས་པ་དེ་ལྟ་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means that they are all, ultimately, afflictions for bodhisattvas so they should be abandoned, but not like attachment and so on. “

source: །གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མཚན་མར་བཟུང་བ་ཞིག་ལགས་ན་ནི་ཀུན་ཏུ་རྒྱུ་བཟོ་སྦྱངས་ཀྱང་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་མཚན་མ་མེད་པར་སྒྲུབ་པ་ཉིད་གསལ་བར་བྱེད་པ་སྟེ།
en: If the perfection of wisdom were something that could be taken up through a causal sign, then the religious mendicant Śreṇika,” and so on, is an elucidation of the practice without causal signs. “

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་འདི་ལ་ཀུན་ཏུ་རྒྱུ་བཟོ་སྦྱངས་ཀྱང་མོས་པར་འགྱུར་ཞེས་བྱ་བ་ནི་ཀུན་ཏུ་རྒྱུ་དེ་སྔོན་མཚན་མ་མེད་པར་སྒྲུབ་པ་མ་གཏོགས་པ་དེ་ལ་དད་པ་བསྐྱེད་དེ།
en: The religious mendicant Śreṇika also believed in this knowledge of a knower of all aspects.” Earlier, that religious mendicant had not realized the practice without causal signs.

source: དད་པ་དེ་ཉིད་ཀྱིས་མཚན་མ་མེད་པའི་ཤེས་པ་སྐྱེས་ཤིང་ཐོབ་པར་གྱུར་གྱི། ཆོས་ཐམས་ཅད་ཡུལ་དུ་མ་གྱུར་པའི་ཕྱིར་མཚན་མ་མེད་པའི་ཤེས་པས་ནི་མ་ཡིན་ནོ།
en: He had generated a faith in it, and with just that faith he produced and gained knowledge free from causal signs, but because all dharmas were not its object it was not the knowledge without causal signs. “

source: །ཉི་ཚེ་བའི་ཤེས་པ་ཞེས་བྱ་བ་ནི་ཆོས་རྣམས་ལ་སོ་སོར་ཞུགས་ནས། གཟུགས་བཟུང་སྟེ་སོ་སོར་བརྟགས་ན་གཟུགས་ཀྱི་མཚན་མ་མ་དམིགས་སོ།
en: Partial knowledge”— having comprehended dharmas, each individually, he did not apprehend the causal sign of form when he had fully grasped and understood form analytically.

source: །དེ་བཞིན་དུ་ཚོར་བ་ལ་སོགས་པ་བཟུང་སྟེ། སོ་སོར་བརྟགས་ན་ཚོར་བ་ལ་སོགས་པའི་ཆོས་ཀྱི་མཚན་མ་ཡང་མ་དམིགས་སོ།
en: Similarly, he did not apprehend the causal sign of feeling when he had fully grasped and understood feeling analytically.

source: །དེ་བས་ན་དེ་དེ་ལྟར་ཞུགས་ནས་གཟུགས་ཡོངས་སུ་མ་བཟུང་།
en: Hence it says, “Having thus comprehended [he] did not fully grasp form.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་མ་བཟུང་ཞེས་བྱ་བ་ནས། ཡང་དག་པའི་མཐའ་ཡོངས་སུ་མ་བཟུང་ཞེས་བྱ་བའི་བར་དུ་བཤད་དེ།
en: Similarly, he did not fully grasp feeling, perception, volitional factors, or consciousness,” up to “he has not fully grasped even the very limit of reality.”

source: དེའི་གཏན་ཚིགས་བསྟན་པའི་ཕྱིར་དེས་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཆོས་ཐམས་ཅད་ལ་ཡོངས་སུ་འཛིན་པ་མི་དམིགས་ཏེ་ཞེས་བྱ་བ་བཤད་དེ།
en: To teach the reason for that, it explains “because he did not apprehend a grasper of all dharmas that are empty of their own mark.”

source: མཚན་མ་མེད་པའི་ཤེས་པ་དེས་རེ་རེ་ལ་མཚན་མ་མེད་པའི་རྣམ་པར་ཞུགས་པས། ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་ཤེས་པར་འགྱུར་ཏེ།
en: By having comprehended with that signless knowledge each of them individually in the form of signlessness, he comes to understand that all dharmas are empty of their own mark.

source: དེ་བས་ན་ཡོངས་སུ་འཛིན་པའི་གང་ཟག་གམ། ཤེས་པ་མ་དམིགས་སོ།
en: Hence “he did not apprehend” a person or knower that is “a grasper.”

source: །ཡང་དེའི་གཏན་ཚིགས་སུ་འདི་ལྟར་དེས་ཤེས་པ་ཐོབ་པ་དང་། མངོན་པར་རྟོགས་པའི་ཚུལ་གྱིས་ཤེས་པ་དེ་ནང་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་། ཕྱི་རོལ་ཏུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་།
en: Also, as a reason for that it says, “Because he did not see that knowledge as being an inner attainment and clear realization of knowledge, and he did not see it as being an outer one.

source: ཐོས་པ་དང་མངོན་པར་རྟོགས་པའི་ཚུལ་གྱིས་ཤེས་པ་དེ་ཕྱི་ནང་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་། ཐོས་པ་དང་མངོན་པར་རྟོགས་པའི་ཚུལ་གྱིས་ཤེས་པ་དེ་བཞིན་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བའི་སླད་དུའོ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: He did not see that knowledge as being an inner and outer attainment and clear realization, and he did not see that attainment and clear realization of knowledge as being some other either.”

source: ཀུན་ཏུ་རྒྱུ་དེས་བདག་གི་ཤེས་པ་བཟུང་ནས་བདག་གི་ཤེས་པ་འདིས་ཆོས་ཀྱི་ཁྱད་པར་མ་ཐོབ་པ་རྣམས་ཐོབ་པོ་ཞེ་འམ། བདག་ཤེས་པ་འདིས་མངོན་པར་མ་རྟོགས་པའི་ཆོས་རྣམས་མངོན་པར་མ་རྟོགས་སོ་ཞེས་ཐོབ་པ་དང་། མངོན་པར་རྟོགས་པ་ཡོངས་སུ་བརྟགས་ནས་ཤེས་པ་དེ་བདག་ལ་གནས་པ་དང་། ཕྱི་རོལ་ལ་གནས་པ་དང་། གཉིས་ཀ་ལ་གནས་པ་དང་།
en: This means that religious mendicant, having taken hold of his knowledge and fully investigated the attainment and the realization—whether with this knowledge of his he had attained special dharmas he had not attained before, or whether the dharmas he had clearly realized with this knowledge had not been clearly realized before—did not see the knowledge as located in him, located outside, located in both, or located somewhere else besides those.

source: དེ་ལས་གཞན་པ་འགའ་ཞིག་ལ་གནས་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །དེ་བས་ན་འདི་ལྟར་དེས་གང་གིས་རྟོགས་པར་བགྱི་བ་དང་། གང་རྟོགས་པར་བགྱི་བའི་ཤེས་པ་དེ་མི་དམིགས་ཏེ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Hence it says “because he did not apprehend and did not see that with which he might know, or that which the knowledge might know.”

source: དེ་ལ་གང་གིས་ཞེས་བྱ་བ་ནི་ཤེས་པ་དེས་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: There the “that with which” is teaching “that knowledge with which.”

source: །གང་ཞེས་བྱ་བ་ནི་བདག་གིས་ཐོབ་པོ། །མངོན་པར་རྟོགས་སོ་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: The “that which” is teaching “that which he has attained and clearly realized.”

source: །གང་ཞེས་བྱ་བ་ནི་མ་ཐོབ་པ་དང་། མངོན་པར་མ་རྟོགས་པའི་ཆོས་རྣམས་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: The “that which” is also teaching the dharmas he has not attained and has not clearly realized.

source: །དེ་ལྟར་ཐོབ་པ་དང་། མངོན་པར་རྟོགས་པའི་ཤེས་པ་ལ་རྣམ་པར་རྟོག་པ་བཞི་མེད་པར་བསྟན་ནས། དེའི་འོག་ཏུ་གཟུགས་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་ཡུལ་དུ་གྱུར་པའི་ཤེས་པ་ལ་ཡང་རྣམ་པར་རྟོག་པ་དེ་བཞི་མི་འཇུག་པར་བསྟན་པའི་ཕྱིར། དེས་ཤེས་པ་དེ་གཟུགས་ཀྱི་ནང་དུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པ་བཤད་དེ།
en: Not Fully Grasping Understanding Having thus taught that knowledge of attainment and clear realization does not exist as any of the four alternatives, then, in order to teach that knowledge of all dharmas—form and so on, which are objects—also does not operate as any of the four alternatives, it says “he did not see that knowledge inside form,” and so on.

source: གཟུགས་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་ཡུལ་དུ་གྱུར་པའི་ཤེས་པ་ཡང་ནང་དང་ཕྱི་རོལ་དང་། གཉི་ག་དང་། དེ་ལས་གཞན་པ་ལ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means that he also did not see the knowledge of all dharmas—form and so on, which are objects—inside, outside, in both, or somewhere else.

source: །དེ་ཉིད་ཡང་གསལ་བར་བྱ་བའི་ཕྱིར་རྣམ་གྲངས་འདི་ལ་ཀུན་ཏུ་རྒྱུ་བཟོ་སྦྱངས་ཀྱང་མོས་པར་འགྱུར་ཏེ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནས། མཚན་མ་མ་མཆིས་པར་ཡིད་ལ་བགྱིད་པའི་སླད་དུ་ཞེས་བྱ་བའི་བར་དུ་བཤད་དོ།
en: To again elucidate just that, it says, “The religious mendicant Śreṇika believed in this one of many explanations,” and so on, up to “because he did not pay attention to any causal signs.”

source: །བཅོམ་ལྡན་འདས་འདི་ནི་གཞན་གྱི་ཕ་རོལ་དུ་མཆིས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ་ཞེས་བྱ་བ་ནི་ཡོངས་སུ་འཛིན་པ་མེད་པར་སྒྲུབ་པ་ཡོངས་སུ་ཤེས་པ་འདིའི་ཕན་ཡོན་བསྟན་ཏོ།
en: This teaches the benefit of this comprehension of practice that does not fully grasp. “Lord, this—… the state in which the bodhisattva great beings have gone beyond the others; it is the perfection of wisdom.”

source: །འདི་ལྟར་ཆོས་ཐམས་ཅད་ལས་གཞན་པའི་ཕ་རོལ་ནི་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་དང་། མཚན་མ་ཐམས་ཅད་ལས་གཞན་དུ་གྱུར་པའོ།
en: This means it is thus a beyond that is different from all other dharmas, which has become different from all conceptualizations and all causal signs.

source: །རྣམ་པར་མི་རྟོག་པ་ནི་ཕ་རོལ་ཏེ། མཚན་མ་མེད་པའི་ཕ་རོལ་དུ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: The absence of conceptualization is the beyond in the sense that signlessness is the “beyond.”

source: །གཞན་གྱི་ཕ་རོལ་དེ་གང་ཡིན་སྙམ་པ་ལ།
en: What is that which is beyond the others?

source: གང་ལ་གཟུགས་ཡོངས་སུ་མི་འཛིན་པ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ།
en: It says “that he does not fully grasp form,” and so on.

source: གང་གི་ཕྱིར་གཟུགས་ལ་སོགས་པ་ཡོངས་སུ་འཛིན་པ་མེད་པ་དེའི་ཕྱིར་གཞན་གྱི་ཕ་རོལ་ཞེས་བྱའོ། །བར་མ་དོར་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་ཞེས་བྱ་བ་ནི་ཀུན་ཏུ་རྒྱུ་དེ་སངས་རྒྱས་ཀྱི་རིགས་ཅན་ཡིན་པའི་ཕྱིར།
en: Because he does not fully grasp form and so on, he is therefore “beyond the others.” “

source: བར་མ་དོར་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའོ།
en: In the interim they do not pass into complete nirvāṇa.”

source: །བར་དུ་ཞེས་བྱ་བ་སྨོས་པ་ནི་སྨོན་ལམ་དེ་དག་སྨོན་ལམ་མ་ལགས།
en: That religious mendicant Śreṇika is in the buddha lineage so in the interim he does not pass into nirvāṇa.

source: སྟོབས་དེ་དག་སྟོབས་མ་ལགས། མི་འཇིགས་པ་དེ་དག་མི་འཇིགས་པ་མ་ལགས། སོ་སོ་ཡང་དག་པར་རིག་པ་དེ་དག་སོ་སོ་ཡང་དག་པར་རིག་པ་མ་ལགས་ཞེས་བྱ་བ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་མ་ལགས་ཞེས་བྱ་བ་ལ། བར་དུ་ཞེས་བྱ་བ་སྨོས་པ་འདིས་གཞན་གྱི་ཕ་རོལ་སྟོན་ཏོ།
en: As for saying “in the interim,” it says “those prayers are nonprayers, those powers are nonpowers, those fearlessnesses are nonfearlessnesses, those detailed and thorough knowledges are nondetailed and nonthorough knowledges, up to those eighteen distinct attributes of a buddha are nonbuddhadharmas,” so this “in the interim” teaches they are beyond the others.

source: །དེ་ལྟར་ཡོངས་སུ་འཛིན་པ་མེད་པར་སྒྲུབ་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། དེའི་འོག་ཏུ་ཡོངས་སུ་བརྟགས་པའི་སྒྲུབ་པ་བརྩམས་ཏེ། བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་ལྟར་ཡོངས་སུ་བརྟགས་པར་བགྱི་སྟེ་ཞེས་བྱ་བ་ལ་སོགས་པ་བཤད་དོ།
en: Practice that has made a full investigation Having thus made fully complete the practice that does not fully grasp, next, taking the practice that has made a full investigation as its point of departure, it says, “Furthermore, Lord, bodhisattva great beings practicing the perfection of wisdom should make an investigation like this,” and so on.

source: །ཡོངས་སུ་བརྟགས་པའི་སྒྲུབ་པ་འདི་ཡང་རྣམ་པ་བཞིར་བསྟན་ཏེ། འདི་ནི་གང་ཞེས་བྱ་བ་དང་། འདི་ནི་གང་གི་ཞེས་བྱ་བ་དང་། འདི་ནི་ཅིའི་ཕྱིར་ཞེས་བྱ་བ་དང་། འདི་ཅི་ཞིག་ན་ཞེས་བྱ་བའོ།
en: This practice that has made a full investigation is taught in four parts as well: “What is it… of what is it… why is it… and what is it for?”

source: །དེ་དེ་ལྟར་ཡོངས་སུ་རྟོག་ཅིང་དེ་ལྟར་སེམས་པའི་ཚེ་ཞེས་བྱ་བ་ནས་བཟུང་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་མ་བྲལ་བ་ཞེས་བྱ་བའི་བར་དུ་ནི་འདི་གང་ཞེས་བྱ་བ་སྟོན་ཏོ།
en: From “if, when they investigate and ponder like that,” up to “thus, practicing the perfection of wisdom… are not separated from the knowledge of all aspects,” teaches the “what.”

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་གཟུགས་ནི་གཟུགས་ཀྱི་རང་བཞིན་དང་བྲལ་བ་ཞེས་བྱ་བ་ནས། ཡང་དག་པའི་མཐའ་ནི་ཡང་དག་པའི་མཐའི་རང་བཞིན་དང་བྲལ་བ་ཞེས་བྱའི་བར་དུ་ནི་འདི་གང་ཞེས་བྱ་བ་སྟོན་ཏོ།
en: From “Venerable Śāriputra, form is separated from the intrinsic nature of form,” up to “the very limit of reality is separated from the intrinsic nature of the very limit of reality,” teaches the “of what.”

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་གཞན་ཡང་གཟུགས་ལ་གཟུགས་ཀྱི་མཚན་ཉིད་མེད་དོ་ཞེས་བྱ་བ་ནས་གང་བསླབ་པ་འདི་ལ་སློབ་པ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུ་ནི་འདི་ནི་ཅིའི་ཕྱིར་ཞེས་བྱ་བ་སྟོན་ཏོ།
en: From “furthermore, Venerable Śāriputra, form does not have the defining mark of form,” up to “bodhisattva great beings who are training in this training go forth to the knowledge of all aspects,” teaches the “why.”

source: །ཆོས་ཐམས་ཅད་མ་སྐྱེས་པ་དང་། ངེས་པར་འགྱུར་བ་མེད་པ་ཞེས་བྱ་བ་ནས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དང་ཉེ་བ་ཡིན་ཞེས་བྱ་བའི་བར་དུ་ནི་འདི་ཅི་ཞིག་ན་ཞེས་བྱ་བ་སྟོན་ཏོ།
en: From “all dharmas have not been produced and have not gone forth,” up to “Venerable Śāriputra, a bodhisattva great being thus practicing the perfection of wisdom is near unsurpassed, perfect, complete awakening,” teaches the “what it is for.”

source: །དེ་ལ་འདི་གང་ཞེས་བྱ་བ་དེའི་རང་བཞིན་འདྲི་བ་སྟེ།
en: There, “what is it” is a question about its basic nature.

source: དེ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་རྟོགས་པའོ་ཞེས་དེ་སྐད་བརྗོད་པར་བྱའོ།
en: There the perfection of wisdom should be described as a realization. “

source: །འདི་ནི་གང་གི་ཞེས་བྱ་བ་ནི་འབྲེལ་བ་འདྲི་བ་སྟེ།
en: Of what is it” is a question about what it is connected with.

source: དེ་ལ་ཆོས་ཐམས་ཅད་ཀྱིའོ་ཞེས་དེ་སྐད་བརྗོད་པར་བྱའོ།
en: There it should be described as a realization of all dharmas. “

source: །འདི་ཅིའི་ཕྱིར་ཞེས་བྱ་བ་ནི། ཅིའི་ཕྱིར་འདི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་ཞེས་གཏན་ཚིགས་འདྲི་བ་སྟེ།
en: Why is it” is a question about the reason it is the perfection of wisdom.

source: དེ་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་ཉིད་ཀྱི་མཚན་ཉིད་རྟོགས་པའི་ཕྱིར་རོ་ཞེས་བརྗོད་པར་བྱའོ།
en: There it should be said it is because it is a realization marked by the state of things as they really are. “

source: །འདི་ཅི་ཞིག་ན་ཞེས་བྱ་བ་ནི་བྱེད་པ་འདྲི་བ་སྟེ།
en: What is it for” is a question about function.

source: དེ་ལ་ངེས་པར་འབྱིན་པའི་ཕྱིར་རོ་ཞེས་བརྗོད་པར་བྱའོ།
en: There it should be said it is because it causes an escape.
